{"sender_name": "ICML 2025", "subject": "[ICML 2025] Camera-ready instructions for accepted papers", "content": "<html><body style=\"font-family: Arial, sans-serif; line-height: 1.6; color: #333;\"><p>Dear <strong><<<<||||name||||>>>></strong>,</p><p><strong style=\"color: #2c5aa0;\">Congratulations on your accepted ICML 2025 paper!</strong></p><p>The camera-ready submission is due on <strong>May 29, 2025 (11:59pm AoE)</strong>. Please make sure to follow the steps below before this deadline to avoid your paper being withdrawn from ICML. Detailed instructions are given below, with the main <strong>mandatory actions</strong> being the following:</p><ol><li>At least one author must register for the conference with the <strong>'Conference'</strong> option checked in the registration form; <em>'Virtual Pass' alone is not sufficient</em> (see item 4 below).</li><li>At least one author needs to digitally sign the publication consent form (see item 5 below)</li><li>The presenting author needs to digitally sign the consent form (see item 5 below).</li><li>The corresponding author needs to sign the PMLR publication agreement form and upload it in pdf format together with the camera-ready submission (see item 6 below). <em>(Note: Maximum file sizes 20MB)</em></li><li>Your camera-ready pdf should include a mandatory impact statement just before the bibliography (see the call for papers for instructions). Acknowledgments, the impact statement, and references are excluded from the 9 page limit.</li><li>Complete the camera-ready form on OpenReview (see items 7-10 below).</li></ol><p><strong>Please follow the guidelines below:</strong></p><ol><li>In the camera-ready version, you have an <strong>extra page</strong> to address reviewer comments, so the length limit of the paper body is <strong>9 pages</strong>, followed by any acknowledgements, the impact statement, and references.</li><li>You should include any appendices of the paper as part of the camera-ready pdf. There is <strong>NO</strong> camera-ready supplementary material of any kind, as these will not be listed on PMLR nor on OpenReview. If you have code or other material that you want the readers to have access to, please upload it to a repository (e.g., GitHub) and include a link in your paper. We also encourage you to include the url link to the code in the optional \"code url\" box on OpenReview – this will appear on the OpenReview entry of the paper as well as on PMLR.</li><li>You are allowed to change the author order on the camera-ready submission page, but <strong>no author additions are allowed</strong>. You are also allowed to change the title and abstract slightly. If you want to change the title significantly with a good reason (for instance, it was suggested by the meta reviewer), then you should get permission from the program chairs.</li><li><strong>Register for the conference:</strong> go to <a href=\"https://icml.cc\">icml.cc</a> and click \"Registration 2025\". From there, you can log in if you have an existing profile, or create a new profile. At least one author must register with the checkbox <strong>'Conference'</strong> ticked under the 'Sessions' list in the registration form; selecting 'Virtual Pass' alone is <strong>not sufficient</strong>.</li><li>At least one author needs to digitally sign the <strong>ICML 2025 Publishing Release form</strong>, and the presenting author needs to sign the <strong>ICML 2025 Recording Release and License form</strong>, both at <a href=\"https://icml.cc/ConsentForm\">https://icml.cc/ConsentForm</a> (you will need to log in to icml.cc to see your paper(s)).</li><li>The <strong>PMLR Publication Agreement form</strong> (available at <a href=\"http://proceedings.mlr.press/pmlr-license-agreement.pdf\">http://proceedings.mlr.press/pmlr-license-agreement.pdf</a>) should be filled and signed by the corresponding author and uploaded as part of the camera-ready form.</li><li>The camera-ready version should be prepared using the LaTeX style file from <a href=\"https://media.icml.cc/Conferences/ICML2025/Styles/icml2025.zip\">https://media.icml.cc/Conferences/ICML2025/Styles/icml2025.zip</a> with the <code>\\usepackage[accepted]{icml2025}</code> option. Please note that for camera-ready there is a <strong>mandatory impact statement</strong> in an unnumbered section just before the bibliography. Acknowledgments can also optionally be included in another unnumbered section. Both Acknowledgments and Impact Statement are excluded from the 9-page limit.</li><li>Check the pdf file of your paper with the <strong>ICML format checker</strong>. Read the instructions at <a href=\"https://papercheck.icml.cc/papercheck.html\">https://papercheck.icml.cc/papercheck.html</a>, and upload your camera-ready paper for automatic checking of the guidelines (if there are errors, you can upload again until all detected violations are resolved). Upon successful completion of the paper checker, you will obtain a <strong>5-letter submission code</strong> which you will enter in the camera-ready form.</li><li>Upload the required files to the camera-ready form, which you can access via your OpenReview console. Enter your title and abstract in the camera-ready form, exactly matching the paper. You can use TeX math (we suggest sparingly), but no custom macros or other TeX commands. Please make sure that accents, special characters, etc., are entered using TeX commands and not using non-English characters.</li><li><strong style=\"color: #d9534f;\">New this year</strong>, you will be asked to enter a \"lay summary\" of your paper (also called \"plain language summary\") in the OpenReview form. See <a href=\"https://medium.com/@icml2025pc/lay-summaries-at-icml-2025-8d15e395b7f3\">https://medium.com/@icml2025pc/lay-summaries-at-icml-2025-8d15e395b7f3</a> for additional guidelines and examples.</li></ol><p><strong style=\"color: #d9534f;\">Please do not wait until the last day</strong>, as fixes might require some time. Pay special attention to the following:</p><ul><li>The main paper itself must contain no more than <strong>9 pages</strong> (note the extra page compared to the length at submission time). Acknowledgements, impact statement, references, and appendices should follow the main paper in the same pdf file.</li><li>Enter author details as in the TeX file (<code>example_paper.tex</code> in <code>icml2025_style.zip</code> in step 7 above). Check that the affiliations footnote renders correctly. Make sure you have called <code>\\printAffiliationsAndNotice{\\icmlEqualContribution}</code> if multiple authors have made equal contributions, or <code>\\printAffiliationsAndNotice{}</code> otherwise (see comments in the file <code>example_paper.tex</code> near line 113).</li><li>The title and section headings should have content words capitalized, not all caps. For instance, \"Deep Learning for Artificial Intelligence\", and not \"DEEP LEARNING FOR ARTIFICIAL INTELLIGENCE\". For further guidance on capitalization rules, please see here: <a href=\"https://grammar.yourdictionary.com/capitalization/rules-for-capitalization-in-titles.html\">https://grammar.yourdictionary.com/capitalization/rules-for-capitalization-in-titles.html</a>.</li><li>Carefully check your references and replace arXiv citations with peer-reviewed papers where possible (arXiv is generally not peer-reviewed). Please also check that capitalization in your references appears as you intended (for example, use braces like <code>{Markov}</code> in Bibtex entries to make sure that Markov (proper name) keeps its capitalization in the reference).</li><li>We kindly ask all authors to follow our guidelines for writing accessible papers. In particular, we expect that authors (1) review guidelines for accessibility to color-blind and visually impaired; (2) ensure their bibliography is up-to-date, including up-to-date names and venues; (3) use inclusive and respectful language throughout when talking about people.</li><li>This year, there is no Type 3 font check, so you do not have to use TrueType font to pass the check or convert eps figures to png figures to bypass the check. If possible, please use vector graphics (eps or pdf figures) for experimental results such as line plots and bar plots to maximize readability, and only use bitmap graphics for certain illustrations and visualizations that cannot be easily represented by vector graphics.</li><li>Abstracts should be a single paragraph and ideally <strong>4-6 sentences</strong>.</li><li>The citation font size should be the same as that in the main body of the paper.</li><li>Your paper must be in <strong>US letter size</strong> (i.e., not A4 or other sizes).</li><li>Full paper (including appendices) in pdf format (max size <strong>20 MB</strong>; please reduce the size/quality of large images if you exceed this).</li><li>Publication agreement form (max size <strong>10 MB</strong>).</li><li>Please double-check the order of authors in OpenReview to make sure it is consistent with that in the camera-ready version.</li></ul><p>After this year's conference, there will be another window where you may upload small corrections to the paper following the feedback received at the conference. More information on this will follow after the conference.</p><p>If you experience any problems, please email the publication chairs at: <a href=\"mailto:icml2025publication@gmail.com\">icml2025publication@gmail.com</a></p><p>Thank you again for working with us through this process; we look forward to seeing you in July.</p><p>Sincerely,</p><p><strong>Felix Berkenkamp and Tegan Maharaj</strong>, ICML 2025 Publications Chairs<br><strong>Maryam Fazel, Daniel Hsu, Simon Lacoste-Julien and Virginia Smith</strong>, ICML 2025 Program Chairs</p></body></html>", "content_type": "html"}
{"sender_name": "LCFM 2025", "subject": "[LCFM 2025] Invitation to serve as Reviewer", "content": "<html><body style=\"font-family: Arial, sans-serif; line-height: 1.6; color: #333;\"><p>Dear invitee,</p><p>You have been nominated by the program chair committee of <strong>LCFM 2025</strong> to serve as <strong>Reviewer</strong>. As a respected researcher in the area, we hope you will accept and help us make LCFM 2025 a success. Reviews are due <strong>June 2nd AOE</strong>, and we are aiming to assign no more than <strong>1 paper</strong> to each reviewer; at most, we may assign a few reviewers 2 papers.</p><p>You are also welcome to submit papers, so please also consider submitting to LCFM 2025.</p><p>We will be using OpenReview.net with the intention of have an engaging reviewing process inclusive of the whole community.</p><p style=\"margin: 20px 0; padding: 15px; background-color: #e3f2fd; border-radius: 5px;\">To respond the invitation, please click on the following link:<br><br><a href=\"https://openreview.net/invitation?id=ICML.cc/2025/Workshop/LCFM/Reviewers/-/Recruitment&user=<<<<||||email||||>>>>&key=fb62afafb32110f56b8bec713259a98a4c15ee4290e1370b38e08da121e4c464\" style=\"color: #1976d2; font-weight: bold;\">Accept/Decline Invitation</a></p><p><strong style=\"color: #d9534f;\">Please answer within 3 days.</strong></p><p>If you accept, please make sure that your OpenReview account is updated and lists all the emails you are using. Visit <a href=\"http://openreview.net/profile\">http://openreview.net/profile</a> after logging in.</p><p>If you have any questions, please contact <a href=\"mailto:longcontextfm@googlegroups.com\">longcontextfm@googlegroups.com</a>.</p><p>Cheers, and thank you!</p><p><strong>Program Chairs</strong></p></body></html>", "content_type": "html"}
{"sender_name": "ICML 2025", "subject": "[ICML 2025] Camera-ready submission reminder", "content": "<html><body style=\"font-family: Arial, sans-serif; line-height: 1.6; color: #333;\"><p>Dear <strong><<<<||||name||||>>>></strong>,</p><p><strong>Congratulations again on your accepted ICML 2025 paper!</strong></p><p>This is a reminder that the camera-ready submission is due on <strong style=\"color: #d9534f;\">May 29, 2025 (11:59pm AoE)</strong>. Please make sure to follow the steps for the camera-ready submission before this deadline to avoid your paper being withdrawn from ICML: <a href=\"https://icml.cc/Conferences/2025/AuthorInstructions\">https://icml.cc/Conferences/2025/AuthorInstructions</a></p><p>Sincerely,</p><p><strong>Felix Berkenkamp and Tegan Maharaj</strong>, ICML 2025 Publications Chairs<br><strong>Maryam Fazel, Daniel Hsu, Simon Lacoste-Julien and Virginia Smith</strong>, ICML 2025 Program Chairs</p></body></html>", "content_type": "html"}
{"sender_name": "LCFM 2025", "subject": "[LCFM 2025] Reviewer Invitation accepted", "content": "<html><body style=\"font-family: Arial, sans-serif; line-height: 1.6; color: #333;\"><div style=\"background-color: #5cb85c; color: white; padding: 20px; border-radius: 5px; margin-bottom: 20px;\"><h2 style=\"margin: 0;\">Thank you for accepting the invitation to be a Reviewer for LCFM 2025!</h2></div><p>The LCFM 2025 program chairs will be contacting you with more information regarding next steps soon. In the meantime, please add <strong>noreply@openreview.net</strong> to your email contacts to ensure that you receive all communications.</p><p>If you would like to change your decision, please follow the link in the previous invitation email and click on the \"Decline\" button.</p><p style=\"margin-top: 20px; padding: 10px; background-color: #f5f5f5; border-left: 3px solid #888;\"><small>Please note that responding to this email will direct your reply to <a href=\"mailto:longcontextfm@googlegroups.com\">longcontextfm@googlegroups.com</a>.</small></p></body></html>", "content_type": "html"}
{"sender_name": "ICML 2025", "subject": "[ICML 2025] Camera-ready deadline extension", "content": "<html><body style=\"font-family: Arial, sans-serif; line-height: 1.6; color: #333;\"><p>Dear <strong><<<<||||name||||>>>></strong>,</p><p>The camera-ready submission deadline is extended to <strong style=\"color: #5cb85c; font-size: 1.1em;\">June 5, 2025 (11:59pm AoE)</strong>.</p><p>See instructions here: <a href=\"https://icml.cc/Conferences/2025/AuthorInstructions\">https://icml.cc/Conferences/2025/AuthorInstructions</a></p><p><em style=\"color: #666;\">We are aware of the issue with the paper format checker, and are working to resolve it.</em></p><p>Regards,</p><p><strong>ICML 2025 Publications Chairs</strong></p><p style=\"margin-top: 20px; padding: 10px; background-color: #f5f5f5; border-left: 3px solid #d9534f;\"><small>Please note that responding to this email will direct your reply to <a href=\"mailto:publications-chairs@icml.cc\">publications-chairs@icml.cc</a>.</small></p></body></html>", "content_type": "html"}
{"sender_name": "OpenReview", "subject": "[ICML 2025] Oral presentation notification", "content": "<html><body style=\"font-family: Arial, sans-serif; line-height: 1.6; color: #333;\"><p>Dear <strong><<<<||||name||||>>>></strong>,</p><div style=\"background-color: #5cb85c; color: white; padding: 20px; border-radius: 5px; margin: 20px 0; text-align: center;\"><h2 style=\"margin: 0;\">🎉 Congratulations! Your Paper Has Been Selected for an Oral Presentation!</h2></div><p>We are happy to notify you that your submission <strong><<<<||||icml25_paper_title||||>>>></strong> (<a href=\"<<<<||||icml25_paper_url||||>>>>\"><<<<||||icml25_paper_url||||>>>></a>) has been selected for an <strong>oral presentation</strong> at ICML 2025! <strong>120 submissions</strong> were selected for orals this year, representing the <strong style=\"color: #d9534f;\">top ~1%</strong> of all submissions.</p><div style=\"background-color: #f5f5f5; padding: 15px; border-left: 4px solid #2c5aa0; margin: 20px 0;\"><h3 style=\"margin-top: 0; color: #2c5aa0;\">Presentation Details:</h3><ul><li><strong>Duration:</strong> 12 minutes presentation + 2 minutes Q&A</li><li><strong>Dates:</strong> July 15, 16, or 17, 2025</li><li><strong>Format:</strong> In-person only (no remote option)</li></ul></div><p>We will update the schedule here: <a href=\"https://icml.cc/virtual/2025/calendar\">https://icml.cc/virtual/2025/calendar</a> to assign orals to sessions in the next few days.</p><p style=\"margin-top: 30px;\">Congratulations, and thank you for submitting your work to ICML. We are looking forward to seeing you at the conference!</p><p>Sincerely,</p><p><strong>ICML 2025 Program Chairs</strong><br>Maryam Fazel, Daniel Hsu, Simon Lacoste-Julien, Virginia Smith</p></body></html>", "content_type": "html"}